app/controllers/excuses_controller.rb

INSERT INTO "excuses" ("created_at", "desc", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-09-12 02:15:27.567284"], ["desc", "My dog ate my homework!"], ["updated_at", "2014-09-12 02:15:27.567284"]]
---
  def create
    @excuse = Excuse.new(excuse_params)

    respond_to do |format|
      if @excuse.save